{
    "token2idx": {
        "(": 1,
        ")": 2,
        ",": 3,
        "-": 4,
        ".": 5,
        "1": 6,
        "10": 7,
        "10%": 8,
        "100%": 9,
        "2": 10,
        "20%": 11,
        "3": 12,
        "3+3": 13,
        "3+4": 14,
        "30%": 15,
        "4": 16,
        "4+3": 17,
        "4+4": 18,
        "4+5": 19,
        "40%": 20,
        "5": 21,
        "5%": 22,
        "5+4": 23,
        "5+5": 24,
        "50%": 25,
        "6": 26,
        "60%": 27,
        "7": 28,
        "70%": 29,
        "8": 30,
        "80%": 31,
        "9": 32,
        "90%": 33,
        ":": 34,
        ";": 35,
        "<unk>": 36,
        "AIS": 37,
        "Absent": 38,
        "Acinar": 39,
        "Adenocarcinoma": 40,
        "Apocrine": 41,
        "Atypical": 42,
        "B": 43,
        "Breast": 44,
        "CIN": 45,
        "Chronic": 46,
        "Colon": 47,
        "Columnar": 48,
        "Comedo-type": 49,
        "Cribriform": 50,
        "Duct": 51,
        "Ductal": 52,
        "Endocervical": 53,
        "Extranodal": 54,
        "Fibroadenoma": 55,
        "Fibroadenomatoid": 56,
        "Fibrocystic": 57,
        "Fibroepithelial": 58,
        "Focal": 59,
        "Gastrointestinal": 60,
        "Gleason": 61,
        "Gleason's": 62,
        "HPV-associated": 63,
        "HSIL": 64,
        "High": 65,
        "High-grade": 66,
        "Hyperplastic": 67,
        "I": 68,
        "II": 69,
        "III": 70,
        "Intermediate": 71,
        "Intraductal": 72,
        "Invasive": 73,
        "LSIL": 74,
        "Lobular": 75,
        "Low": 76,
        "Low-grade": 77,
        "Lung": 78,
        "MALT": 79,
        "Malignant": 80,
        "Metastatic": 81,
        "Microcalcification": 82,
        "Micropapillary": 83,
        "Mitoses": 84,
        "Mucinous": 85,
        "Necrosis": 86,
        "Neuroendocrine": 87,
        "No": 88,
        "Non-invasive": 89,
        "Non-small": 90,
        "Note": 91,
        "Nuclear": 92,
        "Papillary": 93,
        "Poorly": 94,
        "Present": 95,
        "Prostate": 96,
        "Rectum": 97,
        "Sclerosing": 98,
        "Small": 99,
        "Solid": 100,
        "Squamous": 101,
        "Stomach": 102,
        "The": 103,
        "Tubular": 104,
        "Tubule": 105,
        "Tubulovillous": 106,
        "Type": 107,
        "Urinary": 108,
        "Urothelial": 109,
        "Usual": 110,
        "Uterine": 111,
        "active": 112,
        "adenocarcinoma": 113,
        "adenoma": 114,
        "adenosis": 115,
        "aggregates": 116,
        "and": 117,
        "biopsy": 118,
        "bladder": 119,
        "body": 120,
        "carcinoma": 121,
        "cell": 122,
        "cervicitis": 123,
        "cervix": 124,
        "change": 125,
        "cohesive": 126,
        "colitis": 127,
        "colon": 128,
        "colonoscopic": 129,
        "colposcopic": 130,
        "component": 131,
        "connective": 132,
        "core": 133,
        "core-needle": 134,
        "differentiated": 135,
        "differentiation": 136,
        "dissection": 137,
        "does": 138,
        "ductal": 139,
        "dysplasia": 140,
        "ectasia": 141,
        "endoscopic": 142,
        "epithelial": 143,
        "erosion": 144,
        "evidence": 145,
        "favor": 146,
        "features": 147,
        "fibroadenoma": 148,
        "fibrosis": 149,
        "foreign": 150,
        "formation": 151,
        "foveolar": 152,
        "from": 153,
        "gastritis": 154,
        "glandular": 155,
        "grade": 156,
        "granuloma": 157,
        "granulomatous": 158,
        "group": 159,
        "high": 160,
        "hyperplasia": 161,
        "in": 162,
        "include": 163,
        "includes": 164,
        "inflammation": 165,
        "interstinal": 166,
        "intraepithelial": 167,
        "involvement": 168,
        "lesion": 169,
        "lobular": 170,
        "low": 171,
        "lymphoid": 172,
        "lymphoma": 173,
        "malignancy": 174,
        "mammotome": 175,
        "marginal": 176,
        "metaplasia": 177,
        "micropapillary": 178,
        "moderately": 179,
        "mucinous": 180,
        "mucosal": 181,
        "muscle": 182,
        "necrosis": 183,
        "neoplasm": 184,
        "no": 185,
        "nonspecific": 186,
        "not": 187,
        "of": 188,
        "or": 189,
        "organizing": 190,
        "otherwise": 191,
        "papillary": 192,
        "papilloma": 193,
        "pattern": 194,
        "polyp": 195,
        "polypectomy": 196,
        "poorly": 197,
        "present": 198,
        "primary": 199,
        "proper": 200,
        "punch": 201,
        "reaction": 202,
        "resection": 203,
        "ring": 204,
        "score": 205,
        "serrated": 206,
        "signet": 207,
        "situ": 208,
        "sono-guided": 209,
        "special": 210,
        "specified": 211,
        "specimen": 212,
        "squamous": 213,
        "stromal": 214,
        "subepithelial": 215,
        "submucosal": 216,
        "tissue": 217,
        "transurethral": 218,
        "tumor": 219,
        "type": 220,
        "urothelial": 221,
        "usual": 222,
        "volume": 223,
        "well": 224,
        "with": 225,
        "without": 226,
        "zone": 227
    },
    "idx2token": {
        "1": "(",
        "2": ")",
        "3": ",",
        "4": "-",
        "5": ".",
        "6": "1",
        "7": "10",
        "8": "10%",
        "9": "100%",
        "10": "2",
        "11": "20%",
        "12": "3",
        "13": "3+3",
        "14": "3+4",
        "15": "30%",
        "16": "4",
        "17": "4+3",
        "18": "4+4",
        "19": "4+5",
        "20": "40%",
        "21": "5",
        "22": "5%",
        "23": "5+4",
        "24": "5+5",
        "25": "50%",
        "26": "6",
        "27": "60%",
        "28": "7",
        "29": "70%",
        "30": "8",
        "31": "80%",
        "32": "9",
        "33": "90%",
        "34": ":",
        "35": ";",
        "36": "<unk>",
        "37": "AIS",
        "38": "Absent",
        "39": "Acinar",
        "40": "Adenocarcinoma",
        "41": "Apocrine",
        "42": "Atypical",
        "43": "B",
        "44": "Breast",
        "45": "CIN",
        "46": "Chronic",
        "47": "Colon",
        "48": "Columnar",
        "49": "Comedo-type",
        "50": "Cribriform",
        "51": "Duct",
        "52": "Ductal",
        "53": "Endocervical",
        "54": "Extranodal",
        "55": "Fibroadenoma",
        "56": "Fibroadenomatoid",
        "57": "Fibrocystic",
        "58": "Fibroepithelial",
        "59": "Focal",
        "60": "Gastrointestinal",
        "61": "Gleason",
        "62": "Gleason's",
        "63": "HPV-associated",
        "64": "HSIL",
        "65": "High",
        "66": "High-grade",
        "67": "Hyperplastic",
        "68": "I",
        "69": "II",
        "70": "III",
        "71": "Intermediate",
        "72": "Intraductal",
        "73": "Invasive",
        "74": "LSIL",
        "75": "Lobular",
        "76": "Low",
        "77": "Low-grade",
        "78": "Lung",
        "79": "MALT",
        "80": "Malignant",
        "81": "Metastatic",
        "82": "Microcalcification",
        "83": "Micropapillary",
        "84": "Mitoses",
        "85": "Mucinous",
        "86": "Necrosis",
        "87": "Neuroendocrine",
        "88": "No",
        "89": "Non-invasive",
        "90": "Non-small",
        "91": "Note",
        "92": "Nuclear",
        "93": "Papillary",
        "94": "Poorly",
        "95": "Present",
        "96": "Prostate",
        "97": "Rectum",
        "98": "Sclerosing",
        "99": "Small",
        "100": "Solid",
        "101": "Squamous",
        "102": "Stomach",
        "103": "The",
        "104": "Tubular",
        "105": "Tubule",
        "106": "Tubulovillous",
        "107": "Type",
        "108": "Urinary",
        "109": "Urothelial",
        "110": "Usual",
        "111": "Uterine",
        "112": "active",
        "113": "adenocarcinoma",
        "114": "adenoma",
        "115": "adenosis",
        "116": "aggregates",
        "117": "and",
        "118": "biopsy",
        "119": "bladder",
        "120": "body",
        "121": "carcinoma",
        "122": "cell",
        "123": "cervicitis",
        "124": "cervix",
        "125": "change",
        "126": "cohesive",
        "127": "colitis",
        "128": "colon",
        "129": "colonoscopic",
        "130": "colposcopic",
        "131": "component",
        "132": "connective",
        "133": "core",
        "134": "core-needle",
        "135": "differentiated",
        "136": "differentiation",
        "137": "dissection",
        "138": "does",
        "139": "ductal",
        "140": "dysplasia",
        "141": "ectasia",
        "142": "endoscopic",
        "143": "epithelial",
        "144": "erosion",
        "145": "evidence",
        "146": "favor",
        "147": "features",
        "148": "fibroadenoma",
        "149": "fibrosis",
        "150": "foreign",
        "151": "formation",
        "152": "foveolar",
        "153": "from",
        "154": "gastritis",
        "155": "glandular",
        "156": "grade",
        "157": "granuloma",
        "158": "granulomatous",
        "159": "group",
        "160": "high",
        "161": "hyperplasia",
        "162": "in",
        "163": "include",
        "164": "includes",
        "165": "inflammation",
        "166": "interstinal",
        "167": "intraepithelial",
        "168": "involvement",
        "169": "lesion",
        "170": "lobular",
        "171": "low",
        "172": "lymphoid",
        "173": "lymphoma",
        "174": "malignancy",
        "175": "mammotome",
        "176": "marginal",
        "177": "metaplasia",
        "178": "micropapillary",
        "179": "moderately",
        "180": "mucinous",
        "181": "mucosal",
        "182": "muscle",
        "183": "necrosis",
        "184": "neoplasm",
        "185": "no",
        "186": "nonspecific",
        "187": "not",
        "188": "of",
        "189": "or",
        "190": "organizing",
        "191": "otherwise",
        "192": "papillary",
        "193": "papilloma",
        "194": "pattern",
        "195": "polyp",
        "196": "polypectomy",
        "197": "poorly",
        "198": "present",
        "199": "primary",
        "200": "proper",
        "201": "punch",
        "202": "reaction",
        "203": "resection",
        "204": "ring",
        "205": "score",
        "206": "serrated",
        "207": "signet",
        "208": "situ",
        "209": "sono-guided",
        "210": "special",
        "211": "specified",
        "212": "specimen",
        "213": "squamous",
        "214": "stromal",
        "215": "subepithelial",
        "216": "submucosal",
        "217": "tissue",
        "218": "transurethral",
        "219": "tumor",
        "220": "type",
        "221": "urothelial",
        "222": "usual",
        "223": "volume",
        "224": "well",
        "225": "with",
        "226": "without",
        "227": "zone"
    }
}